* Code
#+BEGIN_SRC python
import numpy as np
import matplotlib.pyplot as plt
from pycse import regress
from scipy import stats

height = np.array([70,63,72,60,66,70,74,65,62,67,65,68], dtype = np.float) #inches
weight = np.array([155,150,180,135,156,168,178,160,132,145,139,152],dtype = np.float) #pounds

H = np.column_stack([height,height**0]) 


# Determining the confdence intervals
alpha = 1-0.95 #the confidence level is 95%

p, pint, se = regress(H,weight,alpha)

slope_interval, intercept_interval = pint


print 'The slope is between {0} at the 95% confdence level'. format(slope_interval)

print  'The intercept is between {0} at the 95% confdence level'. format(intercept_interval)


#Plotting the data and fit
fit = np.poly1d(np.polyfit(height,weight,1)) #creates a linear fit through the desorption barriers data
slope, intercept = np.polyfit(height, weight, 1)

print 'The slope is:' , slope
print 'The intercept is:', intercept

plt.plot(height, weight, 'k*', label = 'Raw data')
plt.plot(height, fit(height), 'r-', label = 'fitted line')
plt.xlabel('Height (inches)')
plt.ylabel('Weight (pounds)')
plt.legend(loc = 'best')
#plt.show()

#Alternate method of plotting
plt.plot(height, weight, 'ko', height, np.dot(H,p),)
plt.xlabel('Height (in)')
plt.ylabel('Weight (lb)')
#plt.show()
#+END_SRC

#+RESULTS:
: The slope is between [ 1.87045726  4.56084709] at the 95% confdence level
: The intercept is between [-150.81054504   29.31837113] at the 95% confdence level
: The slope is: 3.21565217391
: The intercept is: -60.7460869565

